# ImageFlags Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..ImageFlags Property
ViewDisplayBackground Class See Also
---
The image alignment indicators when the type is 'Image'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ViewDisplayBackgroundImageFlags ImageFlags { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ImageFlags As ViewDisplayBackgroundImageFlags
	Get
```

Visual C++
---
```text
public:
property ViewDisplayBackgroundImageFlags ImageFlags {
	ViewDisplayBackgroundImageFlags get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace